RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_blend_reg.h
/**
  ******************************************************************************
  * @file    osd_blend_reg.h
  * @version V1.0
  * @date    2021-06-28
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __OSD_BLEND_REG_H__
#define __OSD_BLEND_REG_H__

#include "bl808.h"

/* 0x0 : obnd_layer_xconfig */
#define OSD_BLEND_OBND_LAYER_XCONFIG_OFFSET (0x0)
#define OSD_BLEND_OBND_X_MIN                OSD_BLEND_OBND_X_MIN
#define OSD_BLEND_OBND_X_MIN_POS            (0U)
#define OSD_BLEND_OBND_X_MIN_LEN            (11U)
#define OSD_BLEND_OBND_X_MIN_MSK            (((1U << OSD_BLEND_OBND_X_MIN_LEN) - 1) << OSD_BLEND_OBND_X_MIN_POS)
#define OSD_BLEND_OBND_X_MIN_UMSK           (~(((1U << OSD_BLEND_OBND_X_MIN_LEN) - 1) << OSD_BLEND_OBND_X_MIN_POS))
#define OSD_BLEND_OBND_X_MAX                OSD_BLEND_OBND_X_MAX
#define OSD_BLEND_OBND_X_MAX_POS            (16U)
#define OSD_BLEND_OBND_X_MAX_LEN            (11U)
#define OSD_BLEND_OBND_X_MAX_MSK            (((1U << OSD_BLEND_OBND_X_MAX_LEN) - 1) << OSD_BLEND_OBND_X_MAX_POS)
#define OSD_BLEND_OBND_X_MAX_UMSK           (~(((1U << OSD_BLEND_OBND_X_MAX_LEN) - 1) << OSD_BLEND_OBND_X_MAX_POS))

/* 0x4 : obnd_layer_yconfig */
#define OSD_BLEND_OBND_LAYER_YCONFIG_OFFSET (0x4)
#define OSD_BLEND_OBND_Y_MIN                OSD_BLEND_OBND_Y_MIN
#define OSD_BLEND_OBND_Y_MIN_POS            (0U)
#define OSD_BLEND_OBND_Y_MIN_LEN            (11U)
#define OSD_BLEND_OBND_Y_MIN_MSK            (((1U << OSD_BLEND_OBND_Y_MIN_LEN) - 1) << OSD_BLEND_OBND_Y_MIN_POS)
#define OSD_BLEND_OBND_Y_MIN_UMSK           (~(((1U << OSD_BLEND_OBND_Y_MIN_LEN) - 1) << OSD_BLEND_OBND_Y_MIN_POS))
#define OSD_BLEND_OBND_Y_MAX                OSD_BLEND_OBND_Y_MAX
#define OSD_BLEND_OBND_Y_MAX_POS            (16U)
#define OSD_BLEND_OBND_Y_MAX_LEN            (11U)
#define OSD_BLEND_OBND_Y_MAX_MSK            (((1U << OSD_BLEND_OBND_Y_MAX_LEN) - 1) << OSD_BLEND_OBND_Y_MAX_POS)
#define OSD_BLEND_OBND_Y_MAX_UMSK           (~(((1U << OSD_BLEND_OBND_Y_MAX_LEN) - 1) << OSD_BLEND_OBND_Y_MAX_POS))

/* 0x8 : obnd_mem_config0 */
#define OSD_BLEND_OBND_MEM_CONFIG0_OFFSET (0x8)
#define OSD_BLEND_OBND_FORCE_SH           OSD_BLEND_OBND_FORCE_SH
#define OSD_BLEND_OBND_FORCE_SH_POS       (0U)
#define OSD_BLEND_OBND_FORCE_SH_LEN       (1U)
#define OSD_BLEND_OBND_FORCE_SH_MSK       (((1U << OSD_BLEND_OBND_FORCE_SH_LEN) - 1) << OSD_BLEND_OBND_FORCE_SH_POS)
#define OSD_BLEND_OBND_FORCE_SH_UMSK      (~(((1U << OSD_BLEND_OBND_FORCE_SH_LEN) - 1) << OSD_BLEND_OBND_FORCE_SH_POS))
#define OSD_BLEND_OBND_LAYER_EN           OSD_BLEND_OBND_LAYER_EN
#define OSD_BLEND_OBND_LAYER_EN_POS       (15U)
#define OSD_BLEND_OBND_LAYER_EN_LEN       (1U)
#define OSD_BLEND_OBND_LAYER_EN_MSK       (((1U << OSD_BLEND_OBND_LAYER_EN_LEN) - 1) << OSD_BLEND_OBND_LAYER_EN_POS)
#define OSD_BLEND_OBND_LAYER_EN_UMSK      (~(((1U << OSD_BLEND_OBND_LAYER_EN_LEN) - 1) << OSD_BLEND_OBND_LAYER_EN_POS))

/* 0xC : obnd_mem_config1 */
#define OSD_BLEND_OBND_MEM_CONFIG1_OFFSET (0xC)
#define OSD_BLEND_OBND_MEM_ADDR           OSD_BLEND_OBND_MEM_ADDR
#define OSD_BLEND_OBND_MEM_ADDR_POS       (0U)
#define OSD_BLEND_OBND_MEM_ADDR_LEN       (32U)
#define OSD_BLEND_OBND_MEM_ADDR_MSK       (((1U << OSD_BLEND_OBND_MEM_ADDR_LEN) - 1) << OSD_BLEND_OBND_MEM_ADDR_POS)
#define OSD_BLEND_OBND_MEM_ADDR_UMSK      (~(((1U << OSD_BLEND_OBND_MEM_ADDR_LEN) - 1) << OSD_BLEND_OBND_MEM_ADDR_POS))

/* 0x10 : obnd_mem_config2 */
#define OSD_BLEND_OBND_MEM_CONFIG2_OFFSET (0x10)
#define OSD_BLEND_OBND_MEM_DW_CNT         OSD_BLEND_OBND_MEM_DW_CNT
#define OSD_BLEND_OBND_MEM_DW_CNT_POS     (0U)
#define OSD_BLEND_OBND_MEM_DW_CNT_LEN     (32U)
#define OSD_BLEND_OBND_MEM_DW_CNT_MSK     (((1U << OSD_BLEND_OBND_MEM_DW_CNT_LEN) - 1) << OSD_BLEND_OBND_MEM_DW_CNT_POS)
#define OSD_BLEND_OBND_MEM_DW_CNT_UMSK    (~(((1U << OSD_BLEND_OBND_MEM_DW_CNT_LEN) - 1) << OSD_BLEND_OBND_MEM_DW_CNT_POS))

/* 0x14 : obnd_layer_config0 */
#define OSD_BLEND_OBND_LAYER_CONFIG0_OFFSET (0x14)
#define OSD_BLEND_OBND_COLOR_FORMAT         OSD_BLEND_OBND_COLOR_FORMAT
#define OSD_BLEND_OBND_COLOR_FORMAT_POS     (0U)
#define OSD_BLEND_OBND_COLOR_FORMAT_LEN     (5U)
#define OSD_BLEND_OBND_COLOR_FORMAT_MSK     (((1U << OSD_BLEND_OBND_COLOR_FORMAT_LEN) - 1) << OSD_BLEND_OBND_COLOR_FORMAT_POS)
#define OSD_BLEND_OBND_COLOR_FORMAT_UMSK    (~(((1U << OSD_BLEND_OBND_COLOR_FORMAT_LEN) - 1) << OSD_BLEND_OBND_COLOR_FORMAT_POS))
#define OSD_BLEND_OBND_ORDER_A              OSD_BLEND_OBND_ORDER_A
#define OSD_BLEND_OBND_ORDER_A_POS          (8U)
#define OSD_BLEND_OBND_ORDER_A_LEN          (2U)
#define OSD_BLEND_OBND_ORDER_A_MSK          (((1U << OSD_BLEND_OBND_ORDER_A_LEN) - 1) << OSD_BLEND_OBND_ORDER_A_POS)
#define OSD_BLEND_OBND_ORDER_A_UMSK         (~(((1U << OSD_BLEND_OBND_ORDER_A_LEN) - 1) << OSD_BLEND_OBND_ORDER_A_POS))
#define OSD_BLEND_OBND_ORDER_RV             OSD_BLEND_OBND_ORDER_RV
#define OSD_BLEND_OBND_ORDER_RV_POS         (10U)
#define OSD_BLEND_OBND_ORDER_RV_LEN         (2U)
#define OSD_BLEND_OBND_ORDER_RV_MSK         (((1U << OSD_BLEND_OBND_ORDER_RV_LEN) - 1) << OSD_BLEND_OBND_ORDER_RV_POS)
#define OSD_BLEND_OBND_ORDER_RV_UMSK        (~(((1U << OSD_BLEND_OBND_ORDER_RV_LEN) - 1) << OSD_BLEND_OBND_ORDER_RV_POS))
#define OSD_BLEND_OBND_ORDER_GY             OSD_BLEND_OBND_ORDER_GY
#define OSD_BLEND_OBND_ORDER_GY_POS         (12U)
#define OSD_BLEND_OBND_ORDER_GY_LEN         (2U)
#define OSD_BLEND_OBND_ORDER_GY_MSK         (((1U << OSD_BLEND_OBND_ORDER_GY_LEN) - 1) << OSD_BLEND_OBND_ORDER_GY_POS)
#define OSD_BLEND_OBND_ORDER_GY_UMSK        (~(((1U << OSD_BLEND_OBND_ORDER_GY_LEN) - 1) << OSD_BLEND_OBND_ORDER_GY_POS))
#define OSD_BLEND_OBND_ORDER_BU             OSD_BLEND_OBND_ORDER_BU
#define OSD_BLEND_OBND_ORDER_BU_POS         (14U)
#define OSD_BLEND_OBND_ORDER_BU_LEN         (2U)
#define OSD_BLEND_OBND_ORDER_BU_MSK         (((1U << OSD_BLEND_OBND_ORDER_BU_LEN) - 1) << OSD_BLEND_OBND_ORDER_BU_POS)
#define OSD_BLEND_OBND_ORDER_BU_UMSK        (~(((1U << OSD_BLEND_OBND_ORDER_BU_LEN) - 1) << OSD_BLEND_OBND_ORDER_BU_POS))
#define OSD_BLEND_OBND_GLOBAL_A_EN          OSD_BLEND_OBND_GLOBAL_A_EN
#define OSD_BLEND_OBND_GLOBAL_A_EN_POS      (16U)
#define OSD_BLEND_OBND_GLOBAL_A_EN_LEN      (1U)
#define OSD_BLEND_OBND_GLOBAL_A_EN_MSK      (((1U << OSD_BLEND_OBND_GLOBAL_A_EN_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_A_EN_POS)
#define OSD_BLEND_OBND_GLOBAL_A_EN_UMSK     (~(((1U << OSD_BLEND_OBND_GLOBAL_A_EN_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_A_EN_POS))
#define OSD_BLEND_OBND_GLOBAL_A             OSD_BLEND_OBND_GLOBAL_A
#define OSD_BLEND_OBND_GLOBAL_A_POS         (24U)
#define OSD_BLEND_OBND_GLOBAL_A_LEN         (8U)
#define OSD_BLEND_OBND_GLOBAL_A_MSK         (((1U << OSD_BLEND_OBND_GLOBAL_A_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_A_POS)
#define OSD_BLEND_OBND_GLOBAL_A_UMSK        (~(((1U << OSD_BLEND_OBND_GLOBAL_A_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_A_POS))

