RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_blend_reg.h
/* 0x18 : obnd_layer_config1 */
#define OSD_BLEND_OBND_LAYER_CONFIG1_OFFSET (0x18)
#define OSD_BLEND_OBND_GLOBAL_COLOR_EN      OSD_BLEND_OBND_GLOBAL_COLOR_EN
#define OSD_BLEND_OBND_GLOBAL_COLOR_EN_POS  (0U)
#define OSD_BLEND_OBND_GLOBAL_COLOR_EN_LEN  (1U)
#define OSD_BLEND_OBND_GLOBAL_COLOR_EN_MSK  (((1U << OSD_BLEND_OBND_GLOBAL_COLOR_EN_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_COLOR_EN_POS)
#define OSD_BLEND_OBND_GLOBAL_COLOR_EN_UMSK (~(((1U << OSD_BLEND_OBND_GLOBAL_COLOR_EN_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_COLOR_EN_POS))
#define OSD_BLEND_OBND_GLOBAL_RV            OSD_BLEND_OBND_GLOBAL_RV
#define OSD_BLEND_OBND_GLOBAL_RV_POS        (8U)
#define OSD_BLEND_OBND_GLOBAL_RV_LEN        (8U)
#define OSD_BLEND_OBND_GLOBAL_RV_MSK        (((1U << OSD_BLEND_OBND_GLOBAL_RV_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_RV_POS)
#define OSD_BLEND_OBND_GLOBAL_RV_UMSK       (~(((1U << OSD_BLEND_OBND_GLOBAL_RV_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_RV_POS))
#define OSD_BLEND_OBND_GLOBAL_GY            OSD_BLEND_OBND_GLOBAL_GY
#define OSD_BLEND_OBND_GLOBAL_GY_POS        (16U)
#define OSD_BLEND_OBND_GLOBAL_GY_LEN        (8U)
#define OSD_BLEND_OBND_GLOBAL_GY_MSK        (((1U << OSD_BLEND_OBND_GLOBAL_GY_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_GY_POS)
#define OSD_BLEND_OBND_GLOBAL_GY_UMSK       (~(((1U << OSD_BLEND_OBND_GLOBAL_GY_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_GY_POS))
#define OSD_BLEND_OBND_GLOBAL_BU            OSD_BLEND_OBND_GLOBAL_BU
#define OSD_BLEND_OBND_GLOBAL_BU_POS        (24U)
#define OSD_BLEND_OBND_GLOBAL_BU_LEN        (8U)
#define OSD_BLEND_OBND_GLOBAL_BU_MSK        (((1U << OSD_BLEND_OBND_GLOBAL_BU_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_BU_POS)
#define OSD_BLEND_OBND_GLOBAL_BU_UMSK       (~(((1U << OSD_BLEND_OBND_GLOBAL_BU_LEN) - 1) << OSD_BLEND_OBND_GLOBAL_BU_POS))

/* 0x1C : obnd_layer_config2 */
#define OSD_BLEND_OBND_LAYER_CONFIG2_OFFSET   (0x1C)
#define OSD_BLEND_OBND_KEY_PALETTE_EN         OSD_BLEND_OBND_KEY_PALETTE_EN
#define OSD_BLEND_OBND_KEY_PALETTE_EN_POS     (0U)
#define OSD_BLEND_OBND_KEY_PALETTE_EN_LEN     (1U)
#define OSD_BLEND_OBND_KEY_PALETTE_EN_MSK     (((1U << OSD_BLEND_OBND_KEY_PALETTE_EN_LEN) - 1) << OSD_BLEND_OBND_KEY_PALETTE_EN_POS)
#define OSD_BLEND_OBND_KEY_PALETTE_EN_UMSK    (~(((1U << OSD_BLEND_OBND_KEY_PALETTE_EN_LEN) - 1) << OSD_BLEND_OBND_KEY_PALETTE_EN_POS))
#define OSD_BLEND_OBND_KEY_INDEX_INV          OSD_BLEND_OBND_KEY_INDEX_INV
#define OSD_BLEND_OBND_KEY_INDEX_INV_POS      (1U)
#define OSD_BLEND_OBND_KEY_INDEX_INV_LEN      (1U)
#define OSD_BLEND_OBND_KEY_INDEX_INV_MSK      (((1U << OSD_BLEND_OBND_KEY_INDEX_INV_LEN) - 1) << OSD_BLEND_OBND_KEY_INDEX_INV_POS)
#define OSD_BLEND_OBND_KEY_INDEX_INV_UMSK     (~(((1U << OSD_BLEND_OBND_KEY_INDEX_INV_LEN) - 1) << OSD_BLEND_OBND_KEY_INDEX_INV_POS))
#define OSD_BLEND_OBND_KEY_INDEX_MIN          OSD_BLEND_OBND_KEY_INDEX_MIN
#define OSD_BLEND_OBND_KEY_INDEX_MIN_POS      (8U)
#define OSD_BLEND_OBND_KEY_INDEX_MIN_LEN      (8U)
#define OSD_BLEND_OBND_KEY_INDEX_MIN_MSK      (((1U << OSD_BLEND_OBND_KEY_INDEX_MIN_LEN) - 1) << OSD_BLEND_OBND_KEY_INDEX_MIN_POS)
#define OSD_BLEND_OBND_KEY_INDEX_MIN_UMSK     (~(((1U << OSD_BLEND_OBND_KEY_INDEX_MIN_LEN) - 1) << OSD_BLEND_OBND_KEY_INDEX_MIN_POS))
#define OSD_BLEND_OBND_KEY_INDEX_MAX          OSD_BLEND_OBND_KEY_INDEX_MAX
#define OSD_BLEND_OBND_KEY_INDEX_MAX_POS      (16U)
#define OSD_BLEND_OBND_KEY_INDEX_MAX_LEN      (8U)
#define OSD_BLEND_OBND_KEY_INDEX_MAX_MSK      (((1U << OSD_BLEND_OBND_KEY_INDEX_MAX_LEN) - 1) << OSD_BLEND_OBND_KEY_INDEX_MAX_POS)
#define OSD_BLEND_OBND_KEY_INDEX_MAX_UMSK     (~(((1U << OSD_BLEND_OBND_KEY_INDEX_MAX_LEN) - 1) << OSD_BLEND_OBND_KEY_INDEX_MAX_POS))
#define OSD_BLEND_OBND_KEY_REPLACE_INDEX      OSD_BLEND_OBND_KEY_REPLACE_INDEX
#define OSD_BLEND_OBND_KEY_REPLACE_INDEX_POS  (24U)
#define OSD_BLEND_OBND_KEY_REPLACE_INDEX_LEN  (8U)
#define OSD_BLEND_OBND_KEY_REPLACE_INDEX_MSK  (((1U << OSD_BLEND_OBND_KEY_REPLACE_INDEX_LEN) - 1) << OSD_BLEND_OBND_KEY_REPLACE_INDEX_POS)
#define OSD_BLEND_OBND_KEY_REPLACE_INDEX_UMSK (~(((1U << OSD_BLEND_OBND_KEY_REPLACE_INDEX_LEN) - 1) << OSD_BLEND_OBND_KEY_REPLACE_INDEX_POS))

/* 0x20 : obnd_layer_config3 */
#define OSD_BLEND_OBND_LAYER_CONFIG3_OFFSET (0x20)
#define OSD_BLEND_OBND_KEY_A_MIN            OSD_BLEND_OBND_KEY_A_MIN
#define OSD_BLEND_OBND_KEY_A_MIN_POS        (0U)
#define OSD_BLEND_OBND_KEY_A_MIN_LEN        (8U)
#define OSD_BLEND_OBND_KEY_A_MIN_MSK        (((1U << OSD_BLEND_OBND_KEY_A_MIN_LEN) - 1) << OSD_BLEND_OBND_KEY_A_MIN_POS)
#define OSD_BLEND_OBND_KEY_A_MIN_UMSK       (~(((1U << OSD_BLEND_OBND_KEY_A_MIN_LEN) - 1) << OSD_BLEND_OBND_KEY_A_MIN_POS))
#define OSD_BLEND_OBND_KEY_A_MAX            OSD_BLEND_OBND_KEY_A_MAX
#define OSD_BLEND_OBND_KEY_A_MAX_POS        (8U)
#define OSD_BLEND_OBND_KEY_A_MAX_LEN        (8U)
#define OSD_BLEND_OBND_KEY_A_MAX_MSK        (((1U << OSD_BLEND_OBND_KEY_A_MAX_LEN) - 1) << OSD_BLEND_OBND_KEY_A_MAX_POS)
#define OSD_BLEND_OBND_KEY_A_MAX_UMSK       (~(((1U << OSD_BLEND_OBND_KEY_A_MAX_LEN) - 1) << OSD_BLEND_OBND_KEY_A_MAX_POS))
#define OSD_BLEND_OBND_KEY_RV_MIN           OSD_BLEND_OBND_KEY_RV_MIN
#define OSD_BLEND_OBND_KEY_RV_MIN_POS       (16U)
#define OSD_BLEND_OBND_KEY_RV_MIN_LEN       (8U)
#define OSD_BLEND_OBND_KEY_RV_MIN_MSK       (((1U << OSD_BLEND_OBND_KEY_RV_MIN_LEN) - 1) << OSD_BLEND_OBND_KEY_RV_MIN_POS)
#define OSD_BLEND_OBND_KEY_RV_MIN_UMSK      (~(((1U << OSD_BLEND_OBND_KEY_RV_MIN_LEN) - 1) << OSD_BLEND_OBND_KEY_RV_MIN_POS))
#define OSD_BLEND_OBND_KEY_RV_MAX           OSD_BLEND_OBND_KEY_RV_MAX
#define OSD_BLEND_OBND_KEY_RV_MAX_POS       (24U)
#define OSD_BLEND_OBND_KEY_RV_MAX_LEN       (8U)
#define OSD_BLEND_OBND_KEY_RV_MAX_MSK       (((1U << OSD_BLEND_OBND_KEY_RV_MAX_LEN) - 1) << OSD_BLEND_OBND_KEY_RV_MAX_POS)
#define OSD_BLEND_OBND_KEY_RV_MAX_UMSK      (~(((1U << OSD_BLEND_OBND_KEY_RV_MAX_LEN) - 1) << OSD_BLEND_OBND_KEY_RV_MAX_POS))

/* 0x24 : obnd_layer_config4 */
#define OSD_BLEND_OBND_LAYER_CONFIG4_OFFSET (0x24)
#define OSD_BLEND_OBND_KEY_GY_MIN           OSD_BLEND_OBND_KEY_GY_MIN
#define OSD_BLEND_OBND_KEY_GY_MIN_POS       (0U)
#define OSD_BLEND_OBND_KEY_GY_MIN_LEN       (8U)
#define OSD_BLEND_OBND_KEY_GY_MIN_MSK       (((1U << OSD_BLEND_OBND_KEY_GY_MIN_LEN) - 1) << OSD_BLEND_OBND_KEY_GY_MIN_POS)
#define OSD_BLEND_OBND_KEY_GY_MIN_UMSK      (~(((1U << OSD_BLEND_OBND_KEY_GY_MIN_LEN) - 1) << OSD_BLEND_OBND_KEY_GY_MIN_POS))
#define OSD_BLEND_OBND_KEY_GY_MAX           OSD_BLEND_OBND_KEY_GY_MAX
#define OSD_BLEND_OBND_KEY_GY_MAX_POS       (8U)
#define OSD_BLEND_OBND_KEY_GY_MAX_LEN       (8U)
#define OSD_BLEND_OBND_KEY_GY_MAX_MSK       (((1U << OSD_BLEND_OBND_KEY_GY_MAX_LEN) - 1) << OSD_BLEND_OBND_KEY_GY_MAX_POS)
#define OSD_BLEND_OBND_KEY_GY_MAX_UMSK      (~(((1U << OSD_BLEND_OBND_KEY_GY_MAX_LEN) - 1) << OSD_BLEND_OBND_KEY_GY_MAX_POS))
#define OSD_BLEND_OBND_KEY_BU_MIN           OSD_BLEND_OBND_KEY_BU_MIN
#define OSD_BLEND_OBND_KEY_BU_MIN_POS       (16U)
#define OSD_BLEND_OBND_KEY_BU_MIN_LEN       (8U)
#define OSD_BLEND_OBND_KEY_BU_MIN_MSK       (((1U << OSD_BLEND_OBND_KEY_BU_MIN_LEN) - 1) << OSD_BLEND_OBND_KEY_BU_MIN_POS)
#define OSD_BLEND_OBND_KEY_BU_MIN_UMSK      (~(((1U << OSD_BLEND_OBND_KEY_BU_MIN_LEN) - 1) << OSD_BLEND_OBND_KEY_BU_MIN_POS))
#define OSD_BLEND_OBND_KEY_BU_MAX           OSD_BLEND_OBND_KEY_BU_MAX
#define OSD_BLEND_OBND_KEY_BU_MAX_POS       (24U)
#define OSD_BLEND_OBND_KEY_BU_MAX_LEN       (8U)
#define OSD_BLEND_OBND_KEY_BU_MAX_MSK       (((1U << OSD_BLEND_OBND_KEY_BU_MAX_LEN) - 1) << OSD_BLEND_OBND_KEY_BU_MAX_POS)
#define OSD_BLEND_OBND_KEY_BU_MAX_UMSK      (~(((1U << OSD_BLEND_OBND_KEY_BU_MAX_LEN) - 1) << OSD_BLEND_OBND_KEY_BU_MAX_POS))

/* 0x28 : obnd_layer_config5 */
#define OSD_BLEND_OBND_LAYER_CONFIG5_OFFSET (0x28)
#define OSD_BLEND_OBND_KEY_REPLACE_A        OSD_BLEND_OBND_KEY_REPLACE_A
#define OSD_BLEND_OBND_KEY_REPLACE_A_POS    (0U)
#define OSD_BLEND_OBND_KEY_REPLACE_A_LEN    (8U)
#define OSD_BLEND_OBND_KEY_REPLACE_A_MSK    (((1U << OSD_BLEND_OBND_KEY_REPLACE_A_LEN) - 1) << OSD_BLEND_OBND_KEY_REPLACE_A_POS)
#define OSD_BLEND_OBND_KEY_REPLACE_A_UMSK   (~(((1U << OSD_BLEND_OBND_KEY_REPLACE_A_LEN) - 1) << OSD_BLEND_OBND_KEY_REPLACE_A_POS))
#define OSD_BLEND_OBND_KEY_REPLACE_RV       OSD_BLEND_OBND_KEY_REPLACE_RV
#define OSD_BLEND_OBND_KEY_REPLACE_RV_POS   (8U)
#define OSD_BLEND_OBND_KEY_REPLACE_RV_LEN   (8U)
#define OSD_BLEND_OBND_KEY_REPLACE_RV_MSK   (((1U << OSD_BLEND_OBND_KEY_REPLACE_RV_LEN) - 1) << OSD_BLEND_OBND_KEY_REPLACE_RV_POS)
#define OSD_BLEND_OBND_KEY_REPLACE_RV_UMSK  (~(((1U << OSD_BLEND_OBND_KEY_REPLACE_RV_LEN) - 1) << OSD_BLEND_OBND_KEY_REPLACE_RV_POS))
#define OSD_BLEND_OBND_KEY_REPLACE_GY       OSD_BLEND_OBND_KEY_REPLACE_GY
#define OSD_BLEND_OBND_KEY_REPLACE_GY_POS   (16U)
#define OSD_BLEND_OBND_KEY_REPLACE_GY_LEN   (8U)
#define OSD_BLEND_OBND_KEY_REPLACE_GY_MSK   (((1U << OSD_BLEND_OBND_KEY_REPLACE_GY_LEN) - 1) << OSD_BLEND_OBND_KEY_REPLACE_GY_POS)
#define OSD_BLEND_OBND_KEY_REPLACE_GY_UMSK  (~(((1U << OSD_BLEND_OBND_KEY_REPLACE_GY_LEN) - 1) << OSD_BLEND_OBND_KEY_REPLACE_GY_POS))
#define OSD_BLEND_OBND_KEY_REPLACE_BU       OSD_BLEND_OBND_KEY_REPLACE_BU
#define OSD_BLEND_OBND_KEY_REPLACE_BU_POS   (24U)
#define OSD_BLEND_OBND_KEY_REPLACE_BU_LEN   (8U)
#define OSD_BLEND_OBND_KEY_REPLACE_BU_MSK   (((1U << OSD_BLEND_OBND_KEY_REPLACE_BU_LEN) - 1) << OSD_BLEND_OBND_KEY_REPLACE_BU_POS)
#define OSD_BLEND_OBND_KEY_REPLACE_BU_UMSK  (~(((1U << OSD_BLEND_OBND_KEY_REPLACE_BU_LEN) - 1) << OSD_BLEND_OBND_KEY_REPLACE_BU_POS))

/* 0x2C : obnd_layer_config6 */
#define OSD_BLEND_OBND_LAYER_CONFIG6_OFFSET (0x2C)
#define OSD_BLEND_OBND_KEY_COLOR_EN         OSD_BLEND_OBND_KEY_COLOR_EN
#define OSD_BLEND_OBND_KEY_COLOR_EN_POS     (0U)
#define OSD_BLEND_OBND_KEY_COLOR_EN_LEN     (1U)
#define OSD_BLEND_OBND_KEY_COLOR_EN_MSK     (((1U << OSD_BLEND_OBND_KEY_COLOR_EN_LEN) - 1) << OSD_BLEND_OBND_KEY_COLOR_EN_POS)
#define OSD_BLEND_OBND_KEY_COLOR_EN_UMSK    (~(((1U << OSD_BLEND_OBND_KEY_COLOR_EN_LEN) - 1) << OSD_BLEND_OBND_KEY_COLOR_EN_POS))
#define OSD_BLEND_OBND_KEY_A_INV            OSD_BLEND_OBND_KEY_A_INV
#define OSD_BLEND_OBND_KEY_A_INV_POS        (1U)
#define OSD_BLEND_OBND_KEY_A_INV_LEN        (1U)
#define OSD_BLEND_OBND_KEY_A_INV_MSK        (((1U << OSD_BLEND_OBND_KEY_A_INV_LEN) - 1) << OSD_BLEND_OBND_KEY_A_INV_POS)
#define OSD_BLEND_OBND_KEY_A_INV_UMSK       (~(((1U << OSD_BLEND_OBND_KEY_A_INV_LEN) - 1) << OSD_BLEND_OBND_KEY_A_INV_POS))
#define OSD_BLEND_OBND_KEY_RV_INV           OSD_BLEND_OBND_KEY_RV_INV
#define OSD_BLEND_OBND_KEY_RV_INV_POS       (2U)
#define OSD_BLEND_OBND_KEY_RV_INV_LEN       (1U)
#define OSD_BLEND_OBND_KEY_RV_INV_MSK       (((1U << OSD_BLEND_OBND_KEY_RV_INV_LEN) - 1) << OSD_BLEND_OBND_KEY_RV_INV_POS)
#define OSD_BLEND_OBND_KEY_RV_INV_UMSK      (~(((1U << OSD_BLEND_OBND_KEY_RV_INV_LEN) - 1) << OSD_BLEND_OBND_KEY_RV_INV_POS))
#define OSD_BLEND_OBND_KEY_GY_INV           OSD_BLEND_OBND_KEY_GY_INV
#define OSD_BLEND_OBND_KEY_GY_INV_POS       (3U)
#define OSD_BLEND_OBND_KEY_GY_INV_LEN       (1U)
#define OSD_BLEND_OBND_KEY_GY_INV_MSK       (((1U << OSD_BLEND_OBND_KEY_GY_INV_LEN) - 1) << OSD_BLEND_OBND_KEY_GY_INV_POS)
#define OSD_BLEND_OBND_KEY_GY_INV_UMSK      (~(((1U << OSD_BLEND_OBND_KEY_GY_INV_LEN) - 1) << OSD_BLEND_OBND_KEY_GY_INV_POS))
#define OSD_BLEND_OBND_KEY_BU_INV           OSD_BLEND_OBND_KEY_BU_INV
#define OSD_BLEND_OBND_KEY_BU_INV_POS       (4U)
#define OSD_BLEND_OBND_KEY_BU_INV_LEN       (1U)
#define OSD_BLEND_OBND_KEY_BU_INV_MSK       (((1U << OSD_BLEND_OBND_KEY_BU_INV_LEN) - 1) << OSD_BLEND_OBND_KEY_BU_INV_POS)
#define OSD_BLEND_OBND_KEY_BU_INV_UMSK      (~(((1U << OSD_BLEND_OBND_KEY_BU_INV_LEN) - 1) << OSD_BLEND_OBND_KEY_BU_INV_POS))
#define OSD_BLEND_OBND_UPDATE_TRIGGER       OSD_BLEND_OBND_UPDATE_TRIGGER
#define OSD_BLEND_OBND_UPDATE_TRIGGER_POS   (5U)
#define OSD_BLEND_OBND_UPDATE_TRIGGER_LEN   (1U)
#define OSD_BLEND_OBND_UPDATE_TRIGGER_MSK   (((1U << OSD_BLEND_OBND_UPDATE_TRIGGER_LEN) - 1) << OSD_BLEND_OBND_UPDATE_TRIGGER_POS)
#define OSD_BLEND_OBND_UPDATE_TRIGGER_UMSK  (~(((1U << OSD_BLEND_OBND_UPDATE_TRIGGER_LEN) - 1) << OSD_BLEND_OBND_UPDATE_TRIGGER_POS))
#define OSD_BLEND_OBND_UPDATE_INDEX         OSD_BLEND_OBND_UPDATE_INDEX
#define OSD_BLEND_OBND_UPDATE_INDEX_POS     (8U)
#define OSD_BLEND_OBND_UPDATE_INDEX_LEN     (8U)
#define OSD_BLEND_OBND_UPDATE_INDEX_MSK     (((1U << OSD_BLEND_OBND_UPDATE_INDEX_LEN) - 1) << OSD_BLEND_OBND_UPDATE_INDEX_POS)
#define OSD_BLEND_OBND_UPDATE_INDEX_UMSK    (~(((1U << OSD_BLEND_OBND_UPDATE_INDEX_LEN) - 1) << OSD_BLEND_OBND_UPDATE_INDEX_POS))

