RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_blend_reg.h
/* 0x30 : obnd_layer_config7 */
#define OSD_BLEND_OBND_LAYER_CONFIG7_OFFSET (0x30)
#define OSD_BLEND_OBND_UPDATE_COLOR         OSD_BLEND_OBND_UPDATE_COLOR
#define OSD_BLEND_OBND_UPDATE_COLOR_POS     (0U)
#define OSD_BLEND_OBND_UPDATE_COLOR_LEN     (32U)
#define OSD_BLEND_OBND_UPDATE_COLOR_MSK     (((1U << OSD_BLEND_OBND_UPDATE_COLOR_LEN) - 1) << OSD_BLEND_OBND_UPDATE_COLOR_POS)
#define OSD_BLEND_OBND_UPDATE_COLOR_UMSK    (~(((1U << OSD_BLEND_OBND_UPDATE_COLOR_LEN) - 1) << OSD_BLEND_OBND_UPDATE_COLOR_POS))

/* 0x40 : obnd_error */
#define OSD_BLEND_OBND_ERROR_OFFSET           (0x40)
#define OSD_BLEND_REG_RFIFO_DRAIN_CLR_W       OSD_BLEND_REG_RFIFO_DRAIN_CLR_W
#define OSD_BLEND_REG_RFIFO_DRAIN_CLR_W_POS   (0U)
#define OSD_BLEND_REG_RFIFO_DRAIN_CLR_W_LEN   (1U)
#define OSD_BLEND_REG_RFIFO_DRAIN_CLR_W_MSK   (((1U << OSD_BLEND_REG_RFIFO_DRAIN_CLR_W_LEN) - 1) << OSD_BLEND_REG_RFIFO_DRAIN_CLR_W_POS)
#define OSD_BLEND_REG_RFIFO_DRAIN_CLR_W_UMSK  (~(((1U << OSD_BLEND_REG_RFIFO_DRAIN_CLR_W_LEN) - 1) << OSD_BLEND_REG_RFIFO_DRAIN_CLR_W_POS))
#define OSD_BLEND_REG_RFIFO_DRAIN_MASK_W      OSD_BLEND_REG_RFIFO_DRAIN_MASK_W
#define OSD_BLEND_REG_RFIFO_DRAIN_MASK_W_POS  (1U)
#define OSD_BLEND_REG_RFIFO_DRAIN_MASK_W_LEN  (1U)
#define OSD_BLEND_REG_RFIFO_DRAIN_MASK_W_MSK  (((1U << OSD_BLEND_REG_RFIFO_DRAIN_MASK_W_LEN) - 1) << OSD_BLEND_REG_RFIFO_DRAIN_MASK_W_POS)
#define OSD_BLEND_REG_RFIFO_DRAIN_MASK_W_UMSK (~(((1U << OSD_BLEND_REG_RFIFO_DRAIN_MASK_W_LEN) - 1) << OSD_BLEND_REG_RFIFO_DRAIN_MASK_W_POS))
#define OSD_BLEND_STS_RFIFO_DRAIN_R           OSD_BLEND_STS_RFIFO_DRAIN_R
#define OSD_BLEND_STS_RFIFO_DRAIN_R_POS       (16U)
#define OSD_BLEND_STS_RFIFO_DRAIN_R_LEN       (1U)
#define OSD_BLEND_STS_RFIFO_DRAIN_R_MSK       (((1U << OSD_BLEND_STS_RFIFO_DRAIN_R_LEN) - 1) << OSD_BLEND_STS_RFIFO_DRAIN_R_POS)
#define OSD_BLEND_STS_RFIFO_DRAIN_R_UMSK      (~(((1U << OSD_BLEND_STS_RFIFO_DRAIN_R_LEN) - 1) << OSD_BLEND_STS_RFIFO_DRAIN_R_POS))

/* 0x44 : obnd_sh */
#define OSD_BLEND_OBND_SH_OFFSET              (0x44)
#define OSD_BLEND_OBND_LAYER_MEM_REQ_CNT      OSD_BLEND_OBND_LAYER_MEM_REQ_CNT
#define OSD_BLEND_OBND_LAYER_MEM_REQ_CNT_POS  (0U)
#define OSD_BLEND_OBND_LAYER_MEM_REQ_CNT_LEN  (32U)
#define OSD_BLEND_OBND_LAYER_MEM_REQ_CNT_MSK  (((1U << OSD_BLEND_OBND_LAYER_MEM_REQ_CNT_LEN) - 1) << OSD_BLEND_OBND_LAYER_MEM_REQ_CNT_POS)
#define OSD_BLEND_OBND_LAYER_MEM_REQ_CNT_UMSK (~(((1U << OSD_BLEND_OBND_LAYER_MEM_REQ_CNT_LEN) - 1) << OSD_BLEND_OBND_LAYER_MEM_REQ_CNT_POS))

struct osd_blend_reg {
    /* 0x0 : obnd_layer_xconfig */
    union {
        struct {
            uint32_t obnd_x_min     : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15 : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t obnd_x_max     : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31 : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_layer_xconfig;

    /* 0x4 : obnd_layer_yconfig */
    union {
        struct {
            uint32_t obnd_y_min     : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15 : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t obnd_y_max     : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31 : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_layer_yconfig;

    /* 0x8 : obnd_mem_config0 */
    union {
        struct {
            uint32_t obnd_force_sh  : 1;  /* [    0],        w1p,        0x0 */
            uint32_t reserved_1_14  : 14; /* [14: 1],       rsvd,        0x0 */
            uint32_t obnd_layer_en  : 1;  /* [   15],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_mem_config0;

    /* 0xC : obnd_mem_config1 */
    union {
        struct {
            uint32_t obnd_mem_addr : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_mem_config1;

    /* 0x10 : obnd_mem_config2 */
    union {
        struct {
            uint32_t obnd_mem_dw_cnt : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_mem_config2;

    /* 0x14 : obnd_layer_config0 */
    union {
        struct {
            uint32_t obnd_color_format : 5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5_7      : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t obnd_order_a      : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t obnd_order_rv     : 2; /* [11:10],        r/w,        0x0 */
            uint32_t obnd_order_gy     : 2; /* [13:12],        r/w,        0x0 */
            uint32_t obnd_order_bu     : 2; /* [15:14],        r/w,        0x0 */
            uint32_t obnd_global_a_en  : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_23    : 7; /* [23:17],       rsvd,        0x0 */
            uint32_t obnd_global_a     : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_layer_config0;

    /* 0x18 : obnd_layer_config1 */
    union {
        struct {
            uint32_t obnd_global_color_en : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7         : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t obnd_global_rv       : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t obnd_global_gy       : 8; /* [23:16],        r/w,        0x0 */
            uint32_t obnd_global_bu       : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_layer_config1;

    /* 0x1C : obnd_layer_config2 */
    union {
        struct {
            uint32_t obnd_key_palette_en    : 1; /* [    0],        r/w,        0x0 */
            uint32_t obnd_key_index_inv     : 1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_7           : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t obnd_key_index_min     : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t obnd_key_index_max     : 8; /* [23:16],        r/w,        0x0 */
            uint32_t obnd_key_replace_index : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_layer_config2;

