RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_blend_reg.h
    /* 0x20 : obnd_layer_config3 */
    union {
        struct {
            uint32_t obnd_key_a_min  : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t obnd_key_a_max  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t obnd_key_rv_min : 8; /* [23:16],        r/w,        0x0 */
            uint32_t obnd_key_rv_max : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_layer_config3;

    /* 0x24 : obnd_layer_config4 */
    union {
        struct {
            uint32_t obnd_key_gy_min : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t obnd_key_gy_max : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t obnd_key_bu_min : 8; /* [23:16],        r/w,        0x0 */
            uint32_t obnd_key_bu_max : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_layer_config4;

    /* 0x28 : obnd_layer_config5 */
    union {
        struct {
            uint32_t obnd_key_replace_a  : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t obnd_key_replace_rv : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t obnd_key_replace_gy : 8; /* [23:16],        r/w,        0x0 */
            uint32_t obnd_key_replace_bu : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_layer_config5;

    /* 0x2C : obnd_layer_config6 */
    union {
        struct {
            uint32_t obnd_key_color_en   : 1;  /* [    0],        r/w,        0x0 */
            uint32_t obnd_key_a_inv      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t obnd_key_rv_inv     : 1;  /* [    2],        r/w,        0x0 */
            uint32_t obnd_key_gy_inv     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t obnd_key_bu_inv     : 1;  /* [    4],        r/w,        0x0 */
            uint32_t obnd_update_trigger : 1;  /* [    5],        w1p,        0x0 */
            uint32_t reserved_6_7        : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t obnd_update_index   : 8;  /* [15: 8],        r/w,        0x0 */
            uint32_t reserved_16_31      : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_layer_config6;

    /* 0x30 : obnd_layer_config7 */
    union {
        struct {
            uint32_t obnd_update_color : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_layer_config7;

    /* 0x34  reserved */
    uint8_t RESERVED0x34[12];

    /* 0x40 : obnd_error */
    union {
        struct {
            uint32_t reg_rfifo_drain_clr_w  : 1;  /* [    0],        w1p,        0x0 */
            uint32_t reg_rfifo_drain_mask_w : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_15          : 14; /* [15: 2],       rsvd,        0x0 */
            uint32_t sts_rfifo_drain_r      : 1;  /* [   16],          r,        0x0 */
            uint32_t reserved_17_31         : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } obnd_error;

    /* 0x44 : obnd_sh */
    union {
        struct {
            uint32_t obnd_layer_mem_req_cnt : 32; /* [31: 0],        r/w,     0x1000 */
        } BF;
        uint32_t WORD;
    } obnd_sh;
};

typedef volatile struct osd_blend_reg osd_blend_reg_t;

#endif /* __OSD_BLEND_REG_H__ */
